andyelsen85-bit/Range-Master/artifacts/firmware/sdkconfig.defaults
# ── Target ────────────────────────────────────────────────────────────────
CONFIG_IDF_TARGET="esp32p4"

# ── Chip revision — Guition JC8012P4A1C uses ESP32-P4 rev v1.3 (ECO2) ───
# REQUIRED: use IDF 5.3.x ONLY.
#   IDF 5.4.2+: hangs in esp_lcd_new_dsi_bus() on ECO2 D-PHY (IDF issue #17778)
#   IDF 5.5.x+: refuses ECO2 entirely (requires v3.1+)
# CONFIG_ESP32P4_REV_MIN_FULL=100 tells the bootloader to accept v1.0+ chips.
CONFIG_ESP32P4_REV_MIN_FULL=100

# ── Flash (JC8012P4A1C has 16 MB flash) ───────────────────────────────────
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

# ── PSRAM ─────────────────────────────────────────────────────────────────
# ESP32-P4 uses HEX PSRAM (AP Memory X16) — requires MODE_HEX, not MODE_OCT.
# Without CONFIG_SPIRAM_MODE_HEX=y the speed choice has no valid mode to attach
# to and is silently ignored, leaving PSRAM stuck at the 20 MHz default.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
# Only two speeds exist for ESP32-P4 hex PSRAM in IDF 5.3.5: 20M (default) and 200M.
# 200M requires IDF_EXPERIMENTAL_FEATURES. The AP Memory chip is rated for 200M;
# "experimental" means Espressif hadn't finished full validation — hardware is capable.
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_SPIRAM_SPEED_200M=y
# SPIRAM_USE_MALLOC integrates PSRAM into the C-library heap so plain
# malloc()/free() can draw from PSRAM when internal SRAM is low.
# (CAPS_ALLOC only exposes PSRAM via heap_caps_malloc — plain malloc()
# would stay in internal DRAM, exhausting it as LVGL allocates widgets.)
CONFIG_SPIRAM_USE_MALLOC=y
# ALWAYSINTERNAL=0: all plain malloc()/free() calls prefer PSRAM.
# Without this, any allocation ≤512 B goes to internal RAM first.
# lv_obj_t (52 B), LVGL styles, FreeRTOS primitives, and esp_hosted
# RPC semaphores are all ≤512 B — they consumed the entire ~93 KB
# internal RAM budget before the WiFi scan could allocate its sync
# semaphore, causing "sem create failed" + assert in hosted_destroy_semaphore.
# DMA/ISR buffers use heap_caps_malloc(MALLOC_CAP_DMA) explicitly and
# are unaffected by this setting.
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=0

# ── MIPI DSI ──────────────────────────────────────────────────────────────
CONFIG_LCD_ENABLE_DEBUG_LOG=n

# ── Power management — REQUIRED for MIPI DSI on ESP32-P4 IDF 5.3.x ───────
# Without CONFIG_PM_ENABLE, esp_perip_clk_init() is a no-op stub (warning:
# "has not been implemented yet"). The MIPI DSI D-PHY PLL reference clock
# (MIPI_DSI_DPHY_PLL_REFCLK_EN) is never enabled, so esp_lcd_new_dsi_bus()
# hangs forever waiting for PLL lock. PM_ENABLE triggers the full clock-init
# path and opens those gates before our display init runs.
CONFIG_PM_ENABLE=y
# Keep tickless idle off — our LVGL loop always has work to do and we don't
# want the scheduler sleeping under the display task.
CONFIG_FREERTOS_USE_TICKLESS_IDLE=n

# ── FreeRTOS ──────────────────────────────────────────────────────────────
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_UNICORE=n

# ── HTTP client ───────────────────────────────────────────────────────────
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# ── NVS ───────────────────────────────────────────────────────────────────
CONFIG_NVS_ENCRYPTION=n

# ── ESP-Hosted SDIO (P4 host ↔ C6 slave) ────────────────────────────────
# C6 slave must be flashed with esp_hosted 2.12.12 slave firmware (SDIO).
# Run tools/flash_c6_slave.sh to build and flash the matching slave.
# CONFIG_ESP_WIFI_REMOTE_LIBRARY_HOSTED=y selects esp_hosted as the WiFi
# backend — confirmed working ("Using Hosted Wi-Fi" in build output).
CONFIG_ESP_WIFI_REMOTE_ENABLED=y
CONFIG_ESP_WIFI_REMOTE_LIBRARY_HOSTED=y
# C6 as slave target (also set by esp_wifi_remote; explicit here for clarity)
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y
# SDIO transport (automatic default for P4+C6, but explicit is safer)
CONFIG_ESP_HOSTED_SDIO_HOST_INTERFACE=y
# Slot 1 — Slot 0 on P4 uses fixed IOMUX pins (GPIO39/40/41/42/43/44), not our wiring
CONFIG_ESP_HOSTED_SDIO_SLOT_1=y
# ── SDIO pin assignments ──────────────────────────────────────────────────
# No overrides needed: the esp_hosted 2.12.12 defaults for ESP32-P4 Slot 1
# already match this board exactly (confirmed from Kconfig + BSP docs):
#   CLK  GPIO18  symbol: ESP_HOSTED_PRIV_SDIO_PIN_CLK_SLOT_1  default=18 ✓
#   CMD  GPIO19  symbol: ESP_HOSTED_PRIV_SDIO_PIN_CMD_SLOT_1  default=19 ✓
#   D0   GPIO14  symbol: ESP_HOSTED_PRIV_SDIO_PIN_D0_SLOT_1   default=14 ✓
#   D1   GPIO15  symbol: ESP_HOSTED_PRIV_SDIO_PIN_D1_4BIT_BUS_SLOT_1 default=15 ✓
#   D2   GPIO16  symbol: ESP_HOSTED_PRIV_SDIO_PIN_D2_4BIT_BUS_SLOT_1 default=16 ✓
#   D3   GPIO17  symbol: ESP_HOSTED_PRIV_SDIO_PIN_D3_4BIT_BUS_SLOT_1 default=17 ✓
#   RST  GPIO54  symbol: ESP_HOSTED_SDIO_GPIO_RESET_SLAVE     default=54 ✓
# To change any pin: add CONFIG_<symbol_name>=<gpio> here.
# SDIO clock — default 40 MHz; 20 MHz conservative start, raise once link stable
CONFIG_ESP_HOSTED_SDIO_CLOCK_FREQ_KHZ=40000
# ── SDIO queue depth — balance DMA RAM vs. burst throughput ──────────────
# Default is TX=20, RX=20. At ~1600 bytes/entry (max WiFi frame, DMA-capable
# internal RAM only), that's ~64 KB of internal SRAM before main_task starts.
# Previously reduced to 6/6 to fix a boot-time DMA-pool crash; that crash was
# cured by ALWAYSINTERNAL=0 freeing general internal RAM. 10/10 gives the RX
# queue enough depth to absorb a TLS response burst without dropping packets.
CONFIG_ESP_HOSTED_SDIO_TX_Q_SIZE=10
CONFIG_ESP_HOSTED_SDIO_RX_Q_SIZE=10
# ── PSRAM DMA reserve pool — disable the pre-reservation entirely ─────────
# IDF's app_startup.c does:
#   #if CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL
#     esp_spiram_reserve_dma_pool(CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL);
#   #endif
# Setting this to 0 compiles the block out completely, bypassing the abort().
# esp_hosted allocates its SDIO DMA buffers with heap_caps_malloc(MALLOC_CAP_DMA)
# directly — it does NOT draw from this pre-reserved pool — so disabling the
# pool has no effect on WiFi/SDIO correctness. The DSI display likewise uses
# its own DMA-capable allocator. There is no consumer of this pool in this project.
# If a future component requires it, set the value to what the component needs
# (e.g. 8192) and delete sdkconfig to let the new default land.
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=0

# ── UART ──────────────────────────────────────────────────────────────────
CONFIG_UART_ISR_IN_IRAM=y

# ── Log level ─────────────────────────────────────────────────────────────
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y
# Verbose logging for WiFi/esp_hosted RPC during scan debugging — remove once confirmed working
CONFIG_LOG_MASTER_LEVEL=y

# ── Partition table ───────────────────────────────────────────────────────
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000

# ── Stack sizes ───────────────────────────────────────────────────────────
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096

CONFIG_ESP_TASK_WDT_TIMEOUT_S=30

# ── Unused wireless stacks — disable to recover ~80 KB of DRAM BSS ───────
# Bluetooth and OpenThread are not used in this project. Leaving them at
# IDF defaults bloats BSS so far that --enable-non-contiguous-regions
# discards sections that cannot fit in internal DRAM.
CONFIG_BT_ENABLED=n
CONFIG_OPENTHREAD_ENABLED=n
CONFIG_IEEE802154_ENABLED=n

# ── lwip / mbedtls DRAM reduction ─────────────────────────────────────────
# IPv6 neighbor-discovery tables (nd6.c) are a major cause of sram_low
# overflow under --enable-non-contiguous-regions on IDF 5.3.x / ESP32-P4.
# This terminal only needs IPv4.
CONFIG_LWIP_IPV6=n
CONFIG_LWIP_MAX_SOCKETS=8
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=16
CONFIG_MBEDTLS_SSL_MAX_CONTENT_LEN=4096
CONFIG_MBEDTLS_ASYMMETRIC_CONTENT_LEN=y
# Raise httpd header buffer — default 512 B is too small for modern browser
# headers (User-Agent + Accept + Cookie → 431 "Request Header Fields Too Large")
CONFIG_HTTPD_MAX_REQ_HDR_LEN=2048
# Disable hardware AES engine — it requires DMA-aligned internal SRAM buffers
# that are unavailable by sync time (LVGL + WiFi stack have fragmented the pool).
# Software AES draws from PSRAM via the system malloc, which is always available.
# TLS handshake is ~200 ms slower but sync runs once per session — acceptable.
CONFIG_MBEDTLS_HARDWARE_AES=n

# ── LVGL memory: use system malloc instead of a static internal pool ──────
# lv_mem_core_builtin.c declares `static uint8_t work_mem_int[LV_MEM_SIZE]`
# in BSS — 64 KB by default (CONFIG_LV_MEM_SIZE_KILOBYTES=64). That single
# array fills all contiguous internal SRAM and causes the
# --enable-non-contiguous-regions linker error on ESP32-P4 / IDF 5.3.x.
#
# CONFIG_LV_USE_CLIB_MALLOC=y selects the "Standard C functions malloc/realloc/free"
# choice (Kconfig line 51-52 in managed_components/lvgl__lvgl/Kconfig).
# LV_MEM_SIZE_KILOBYTES only applies when LV_USE_BUILTIN_MALLOC is selected
# (Kconfig line 98: depends on LV_USE_BUILTIN_MALLOC), so switching to CLIB
# drops work_mem_int from BSS entirely. At runtime lv_malloc() calls the
# system malloc() which draws from PSRAM via SPIRAM_USE_MALLOC above.
CONFIG_LV_USE_CLIB_MALLOC=y

# ── LVGL Montserrat fonts (all sizes used by the UI screens) ──
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_22=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_36=y
CONFIG_LV_FONT_MONTSERRAT_48=y

